Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/atdf/PIC32CM1216LE00064.atdf
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
              <signal group="WO" index="2" function="J" pad="PA10"/>
              <signal group="WO" index="2" function="J" pad="PA18"/>
              <signal group="WO" index="3" function="J" pad="PA11"/>
              <signal group="WO" index="3" function="J" pad="PA19"/>
              <signal group="WO" index="4" function="J" pad="PA22"/>
              <signal group="WO" index="4" function="J" pad="PB16"/>
              <signal group="WO" index="4" function="J" pad="PA14"/>
              <signal group="WO" index="5" function="J" pad="PA15"/>
              <signal group="WO" index="5" function="J" pad="PA23"/>
              <signal group="WO" index="5" function="J" pad="PB17"/>
              <signal group="WO" index="6" function="J" pad="PA12"/>
              <signal group="WO" index="6" function="J" pad="PA16"/>
              <signal group="WO" index="6" function="J" pad="PA20"/>
              <signal group="WO" index="6" function="J" pad="PB12"/>
              <signal group="WO" index="7" function="J" pad="PA13"/>
              <signal group="WO" index="7" function="J" pad="PA17"/>
              <signal group="WO" index="7" function="J" pad="PA21"/>
              <signal group="WO" index="7" function="J" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="25" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="74" caption="Instance index for TCC0"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="J" pad="PA08"/>
              <signal group="WO" index="2" function="J" pad="PA24"/>
              <signal group="WO" index="2" function="J" pad="PB30"/>
              <signal group="WO" index="3" function="J" pad="PA09"/>
              <signal group="WO" index="3" function="J" pad="PA25"/>
              <signal group="WO" index="3" function="J" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="30" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="75" caption="Instance index for TCC1"/>
            </parameters>
          </instance>
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA12"/>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA13"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="33" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="76" caption="Instance index for TCC2"/>
            </parameters>
          </instance>
          <instance name="TCC3">
            <register-group name="TCC3" name-in-module="TCC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="J" pad="PA02"/>
              <signal group="WO" index="0" function="J" pad="PB22"/>
              <signal group="WO" index="1" function="J" pad="PA03"/>
              <signal group="WO" index="1" function="J" pad="PB23"/>
              <signal group="WO" index="2" function="J" pad="PA04"/>
              <signal group="WO" index="2" function="J" pad="PB02"/>
              <signal group="WO" index="3" function="J" pad="PA05"/>
              <signal group="WO" index="3" function="J" pad="PB03"/>
              <signal group="WO" index="4" function="J" pad="PA06"/>
              <signal group="WO" index="4" function="J" pad="PA30"/>
              <signal group="WO" index="5" function="J" pad="PA07"/>
              <signal group="WO" index="5" function="J" pad="PA31"/>
              <signal group="WO" index="6" function="J" pad="PB08"/>
              <signal group="WO" index="7" function="J" pad="PB09"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="36" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="27" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="77" caption="Instance index for TCC3"/>
            </parameters>
          </instance>
        </module>
        <module name="TRAM" id="U2801" version="2.0.0">
          <instance name="TRAM">
            <register-group name="TRAM" name-in-module="TRAM" address-space="base" offset="0x42005400"/>
            <parameters>
              <param name="ADDR_MSB" value="6" caption="Value of the MSB bit of physical RAM address"/>
              <param name="WORDS" value="128" caption="number of 32-bit words in physical RAM"/>
              <param name="INSTANCE_ID" value="85" caption="Instance index for TRAM"/>
            </parameters>
          </instance>
        </module>
