Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/atdf/PIC32CM1216LE00064.atdf
        <register name="FP_DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FPB Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="FP_PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="FP_PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 5">
        </register>
        <register name="FP_PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 6">
        </register>
        <register name="FP_PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 7">
        </register>
        <register name="FP_PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="FP_PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="FP_PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="FP_PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="FP_CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="FP Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="FP_CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="FP Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="FP_CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="FP Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="FP_CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="FP Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="FPB_FP_LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="FREQM" id="U2257" version="2.2.0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
          <bitfield name="DIVREF" caption="Divide Reference Clock" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="GCLK" id="U2122" version="1.1.2" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bit" mask="0x80"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bit" mask="0x100"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bit" mask="0x200"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="8" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
