Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/atdf/PIC32CM1216LE00064.atdf
      <value-group name="NVMCTRL_NSULCK__NSLKEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_SECCTRL__KEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2802" version="1.1.0" caption="Non-Volatile Fuses">
      <register-group name="BOCOR_FUSES">
        <register name="BOCOR_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFE80000" caption="BOCOR Page Word 1">
          <bitfield name="BOOTROM_BOOTPROT" caption="Boot Protection" mask="0x7FF00"/>
        </register>
        <register name="BOCOR_WORD_16" offset="0x40" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 16">
          <bitfield name="BOOTROM_CRCKEY_0" caption="Crc Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_17" offset="0x44" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 17">
          <bitfield name="BOOTROM_CRCKEY_1" caption="Crc Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_18" offset="0x48" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 18">
          <bitfield name="BOOTROM_CRCKEY_2" caption="Crc Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_19" offset="0x4C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 19">
          <bitfield name="BOOTROM_CRCKEY_3" caption="Crc Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP1_FUSES">
        <register name="OTP1_WORD_0" offset="0x0" rw="R" size="4" caption="OTP1 Page Word 0">
          <bitfield name="BOOTROM_SECEN" caption="Security Enable Fuse" mask="0x400"/>
        </register>
        <register name="OTP1_WORD_1" offset="0x4" rw="R" size="4" caption="OTP1 Page Word 1">
          <bitfield name="BOOTROM_NVMCRC" caption="CRC for NVM DWORD" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP2_FUSES">
        <register name="OTP2_WORD_1" offset="0x4" rw="R" size="4" caption="OTP2 Page Word 1">
          <bitfield name="PM_NVM3VSWDIS" caption="3V NVM switch disable" mask="0x8000"/>
        </register>
      </register-group>
      <register-group name="SW_CALIB_FUSES">
        <register name="SW_CALIB_WORD_0" offset="0x0" rw="R" size="4" caption="SW_CALIB Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="DFLLULP_DIV_PL0" caption="DFLLULP DIV at PL0" mask="0x1C0"/>
          <bitfield name="DFLLULP_DIV_PL2" caption="DFLLULP DIV at PL2" mask="0xE00"/>
          <bitfield name="USB_TRANSN" caption="USB pad Transn calibration" mask="0x1F000"/>
          <bitfield name="USB_TRANSP" caption="USB pad Transp calibration" mask="0x3E0000"/>
          <bitfield name="USB_TRIM" caption="USB pad Trim calibration" mask="0x1C00000"/>
          <bitfield name="DFLL48M_COARSE_CAL" caption="DFLL48M Coarse Calibration" mask="0x7E000000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xB08F4377" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_NSULCK" caption="NVM Non-Secure Region Locks" mask="0x38"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x1F80"/>
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x2000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0xC000"/>
          <bitfield name="WDT_RUNSTDBY" caption="WDT Run During Standby" mask="0x2000000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFF0BB" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x200"/>
        </register>
        <register name="USER_WORD_3" offset="0xC" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 3">
          <bitfield name="NVMCTRL_URWEN" caption="User Row Write Enable" mask="0x400"/>
        </register>
      </register-group>
    </module>
    <module name="OPAMP" id="U2237" version="2.0.0" caption="Operational Amplifier">
      <register-group name="OPAMP" caption="Operational Amplifier">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x2" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="OPAMP 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="OPAMP 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="OPAMP 2 Ready" mask="0x4"/>
        </register>
