Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/atdf/PIC32CM1216LE00064.atdf
        <register name="SHPR3" offset="0x20" rw="RW" size="4" access-size="4" caption="System Handler Priority Register 3">
          <bitfield name="PRI_12" caption="Priority of system handler 12, DebugMonitor" mask="0xFF"/>
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0x24" rw="RW" size="4" access-size="4" caption="System Handler Control and State Register">
          <bitfield name="HARDFAULTACT" caption="HardFault exception active state" mask="0x4"/>
          <bitfield name="NMIACT" caption="NMI exception active state" mask="0x20"/>
          <bitfield name="SVCALLACT" caption="SVCall exception active state" mask="0x80"/>
          <bitfield name="PENDSVACT" caption="PendSV exception active state" mask="0x400"/>
          <bitfield name="SYSTICKACT" caption="SysTick exception active state" mask="0x800"/>
          <bitfield name="SVCALLPENDED" caption="SVCall exception pended state" mask="0x8000"/>
          <bitfield name="HARDFAULTPENDED" caption="HardFault exception pended state" mask="0x200000"/>
        </register>
        <register name="DFSR" offset="0x30" rw="RW" size="4" access-size="4" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt or step event" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="Watchpoint event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector Catch event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="External event" mask="0x10"/>
        </register>
        <register name="AFSR" offset="0x3C" rw="RW" size="4" access-size="4" caption="Auxiliary Fault Status Register">
        </register>
        <register name="CLIDR" offset="0x78" rw="R" size="4" access-size="4" caption="Cache Level ID Register">
          <bitfield name="Ctype1" caption="Cache type at level 1" mask="0x7" values="SCB_CLIDR__Ctype"/>
          <bitfield name="Ctype2" caption="Cache type at level 2" mask="0x38" values="SCB_CLIDR__Ctype"/>
          <bitfield name="Ctype3" caption="Cache type at level 3" mask="0x1C0" values="SCB_CLIDR__Ctype"/>
          <bitfield name="Ctype4" caption="Cache type at level 4" mask="0xE00" values="SCB_CLIDR__Ctype"/>
          <bitfield name="Ctype5" caption="Cache type at level 5" mask="0x7000" values="SCB_CLIDR__Ctype"/>
          <bitfield name="Ctype6" caption="Cache type at level 6" mask="0x38000" values="SCB_CLIDR__Ctype"/>
          <bitfield name="Ctype7" caption="Cache type at level 7" mask="0x1C0000" values="SCB_CLIDR__Ctype"/>
          <bitfield name="LoUIS" caption="Level of Unification Inner Shareable" mask="0xE00000"/>
          <bitfield name="LoC" caption="Level of Coherence" mask="0x7000000"/>
          <bitfield name="LoUU" caption="Level of Unification Uniprocessor" mask="0x38000000"/>
          <bitfield name="ICB" caption="Inner cache boundary" mask="0xC0000000" values="SCB_CLIDR__ICB"/>
        </register>
        <register name="CTR" offset="0x7C" rw="R" size="4" access-size="4" caption="Cache Type Register">
          <bitfield name="IminLine" caption="Instruction cache minimum line length" mask="0xF"/>
          <bitfield name="DminLine" caption="Data cache minimum line length" mask="0xF0000"/>
          <bitfield name="ERG" caption="Exclusives Reservation Granule" mask="0xF00000"/>
          <bitfield name="CWG" caption="Cache Write-back Granule" mask="0xF000000"/>
          <bitfield name="Format" caption="Cache Type Register format" mask="0xE0000000" values="SCB_CTR__Format"/>
        </register>
        <register name="CCSIDR" offset="0x80" rw="R" size="4" access-size="4" caption="Current Cache Size ID register">
          <bitfield name="LineSize" caption="log2(number of words per line) - 2" mask="0x7"/>
          <bitfield name="Associativity" caption="Associativity - 1" mask="0x1FF8"/>
          <bitfield name="NumSets" caption="Number of sets - 1" mask="0xFFFE000"/>
          <bitfield name="WA" caption="Write-Allocate" mask="0x10000000"/>
          <bitfield name="RA" caption="Read-Allocate" mask="0x20000000"/>
          <bitfield name="WB" caption="Write-Back" mask="0x40000000"/>
          <bitfield name="WT" caption="Write-Through" mask="0x80000000"/>
        </register>
        <register name="CSSELR" offset="0x84" rw="RW" size="4" access-size="4" caption="Cache Size Selection Register">
          <bitfield name="InD" caption="Instruction not Data" mask="0x1"/>
          <bitfield name="Level" caption="Cache level - 1" mask="0xE"/>
        </register>
      </register-group>
      <value-group name="SCB_ICSR__PENDNMISET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SCB_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SCB_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SCB_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SCB_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
